public/programming/gists/python/scikit-sample.py.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../gists.html">Gists</a> &gt;
</p>
<div id="outline-container-org1c0c6dd" class="outline-2">
<h2 id="org1c0c6dd">Python / scikit-sample.py</h2>
<div class="outline-text-2" id="text-org1c0c6dd">
<p>
Example of using a ML model with scikit-learn.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #989898;"># </span><span style="color: #989898;">scikit-sample.py
</span><span style="color: #989898;"># </span><span style="color: #989898;">================
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span><span style="color: #989898;"># </span><span style="color: #989898;">Example of using a ML model with scikit-learn.
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span><span style="color: #989898;"># </span><span style="color: #989898;">Requirements:
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span><span style="color: #989898;">#  </span><span style="color: #989898;">- matplotlib
</span><span style="color: #989898;">#  </span><span style="color: #989898;">- scikit-learn
</span><span style="color: #989898;">#  </span><span style="color: #989898;">- pandas
</span>
<span style="color: #b6a0ff;">from</span> sklearn.datasets <span style="color: #b6a0ff;">import</span> fetch_california_housing
<span style="color: #b6a0ff;">from</span> sklearn.neighbors <span style="color: #b6a0ff;">import</span> KNeighborsRegressor
<span style="color: #b6a0ff;">from</span> sklearn.preprocessing <span style="color: #b6a0ff;">import</span> StandardScaler
<span style="color: #b6a0ff;">from</span> sklearn.pipeline <span style="color: #b6a0ff;">import</span> Pipeline
<span style="color: #b6a0ff;">from</span> sklearn.model_selection <span style="color: #b6a0ff;">import</span> GridSearchCV
<span style="color: #b6a0ff;">import</span> matplotlib.pylab <span style="color: #b6a0ff;">as</span> plt
<span style="color: #b6a0ff;">import</span> pandas <span style="color: #b6a0ff;">as</span> pd

<span style="color: #989898;"># </span><span style="color: #989898;">Sample dataset
</span><span style="color: #00d3d0;">X</span>, <span style="color: #00d3d0;">y</span> = fetch_california_housing(return_X_y=<span style="color: #00bcff;">True</span>)

<span style="color: #989898;"># </span><span style="color: #989898;">We create a pipeline where we scale the data and specify a model
</span><span style="color: #00d3d0;">pipe</span> = Pipeline([
    (<span style="color: #79a8ff;">"scale"</span>, StandardScaler()),
    (<span style="color: #79a8ff;">"model"</span>, KNeighborsRegressor(n_neighbors=1))
])

<span style="color: #989898;"># </span><span style="color: #989898;">Get all the pipeline settings
</span><span style="color: #989898;"># </span><span style="color: #989898;">print(pipe.get_params())
</span>
<span style="color: #989898;"># </span><span style="color: #989898;">We can try different hyperparameters on the pipeline via the GridSearch
</span><span style="color: #00d3d0;">mod</span> = GridSearchCV(estimator=pipe,
                   param_grid={<span style="color: #79a8ff;">'model__n_neighbors'</span>: [1, 2, 3, 4, 5, 6]},
                   cv=3)

mod.fit(X, y)

<span style="color: #00d3d0;">df</span> = pd.DataFrame(mod.cv_results_)
plt.plot([i <span style="color: #b6a0ff;">for</span> i <span style="color: #b6a0ff;">in</span> <span style="color: #f78fe7;">range</span>(6)],
         df[<span style="color: #79a8ff;">'mean_test_score'</span>])
plt.xlabel(<span style="color: #79a8ff;">'n_neighbors'</span>)
plt.ylabel(<span style="color: #79a8ff;">'mean_tests_score'</span>)
plt.show()
</pre>
</div>


<hr />

<p>
Travel: <a href="../gists.html">Gists</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
